[
  {
    "title": "Controversial Bitcoin upgrade BIP-119 may be decided by end of year",
    "time": "2025-07-14T07:07:00+01:00",
    "description": "If activated, BIP-119 could boost Bitcoin layer 2s like the Lightning Network and Ark while offering end-users safer and easier self-custody solutions.",
    "date": "2025-07-14"
  },
  {
    "title": "Bitcoin is rallying on US deficit concerns, not hype: Analyst",
    "time": "2025-07-14T07:04:46+01:00",
    "description": "Bitcoin has become a macro asset hedge against a $7 trillion deficit swing in the US and understanding that could be key to figuring out where the price is going.",
    "date": "2025-07-14"
  },
  {
    "title": "Bitcoin creator Satoshi Nakamoto is the world’s 11th richest person",
    "time": "2025-07-14T04:55:19+01:00",
    "description": "Bitcoin would need to spike at least 208% and hit $370,000 per token for Satoshi Nakamoto to become richer than the top billionaire on the Forbes billionaires list.",
    "date": "2025-07-14"
  },
  {
    "title": "Bitcoin taps new all-time high at $120K on Coinbase",
    "time": "2025-07-14T04:17:58+01:00",
    "description": "Bitcoin reached a new high on Coinbase at $120,000 amid surging spot ETF flows, network activity, and long-term holder profits, which hint at higher targets.",
    "date": "2025-07-14"
  },
  {
    "title": "Here’s what happened in crypto today",
    "time": "2025-07-13T23:32:43+01:00",
    "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "date": "2025-07-13"
  },
  {
    "title": "Michael Saylor signals Bitcoin buy after one-week hiatus",
    "time": "2025-07-13T18:00:28+01:00",
    "description": "Strategy continues to lead the pack among Bitcoin treasury companies, issuing debt and equity instruments to finance more purchases.",
    "date": "2025-07-13"
  },
  {
    "title": "Bitcoin hits new all-time high above $119K as trader eyes 7-week uptrend",
    "time": "2025-07-13T16:32:57+01:00",
    "description": "BTC price action is copying late 2024 — and that could result in fresh 50% gains, one trader says as late Bitcoin shorts feel the pain again.",
    "date": "2025-07-13"
  },
  {
    "title": "Who owns the most Bitcoin in 2025? The rich list revealed",
    "time": "2025-07-13T15:20:08+01:00",
    "description": "From exchanges and ETFs to sovereign treasuries and crypto billionaires, Bitcoin’s ownership map in 2025 reveals a mix of concentration and quiet decentralization.",
    "date": "2025-07-13"
  },
  {
    "title": "How to day trade crypto using ChatGPT and Grok",
    "time": "2025-07-13T14:23:59+01:00",
    "description": "AI tools like Grok and ChatGPT are changing how traders approach crypto day trading, spotting sentiment shifts in real time and turning them into structured trade plans.",
    "date": "2025-07-13"
  },
  {
    "title": "CZ shares rumors linking Coinbase to Bloomberg’s Trump stablecoin report",
    "time": "2025-07-13T12:42:07+01:00",
    "description": "Binance founder CZ shared a tweet alleging Coinbase as the anonymous source behind Bloomberg’s report targeting Trump’s crypto project and Binance.",
    "date": "2025-07-13"
  },
  {
    "title": "Collapsed crypto firm Ziglu faces $2.7M deficit amid special administration",
    "time": "2025-07-13T11:27:21+01:00",
    "description": "Thousands of savers face potential losses after a $2.7 million shortfall was discovered at Ziglu, a British crypto fintech that entered special administration.",
    "date": "2025-07-13"
  },
  {
    "title": "Czech central bank adds Coinbase to portfolio, boosts Palantir holdings",
    "time": "2025-07-13T09:02:47+01:00",
    "description": "The Czech National Bank boosted its investment in Palantir and entered the crypto space by acquiring Coinbase shares in Q2.",
    "date": "2025-07-13"
  },
  {
    "title": "Bitcoin headed for 36 more public companies by year-end: Blockware",
    "time": "2025-07-13T07:30:17+01:00",
    "description": "The corporate Bitcoin adoption race is “mostly being spearheaded by brand new companies or dying companies you’ve never heard of,” says Blockware.",
    "date": "2025-07-13"
  },
  {
    "title": "Bitcoin retail interest ‘almost nowhere to be found’ as BTC taps highs",
    "time": "2025-07-13T04:42:47+01:00",
    "description": "Bitcoin’s surge to all-time highs has barely moved the needle in Google search interest compared to the spike seen after Donald Trump won the US presidential election in November.",
    "date": "2025-07-13"
  },
  {
    "title": "Schiff says sell Bitcoin for silver as $258K target looms: Hodler’s Digest, July 6 – 12",
    "time": "2025-07-13T01:06:34+01:00",
    "description": "Bitcoin critic Peter Schiff calls Bitcoin a selling opportunity as it hits new highs, high-leverage trader James Wynn deactivates his X account, and other news.",
    "date": "2025-07-13"
  },
  {
    "title": "Bitcoin's four-year market cycle isn't dead — Xapo Bank CEO",
    "time": "2025-07-12T20:59:28+01:00",
    "description": "Seamus Rocca warned that the next Bitcoin market downturn could be sparked organically and not through a single catastrophic event.",
    "date": "2025-07-12"
  },
  {
    "title": "Animoca Brands partners with DDC Enterprise to put BTC treasury to work",
    "time": "2025-07-12T19:35:13+01:00",
    "description": "Animoca Brands joins a growing list of companies adopting a Bitcoin treasury strategy or expanding their existing Bitcoin reserves.",
    "date": "2025-07-12"
  },
  {
    "title": "Telegram is not a neobank — it’s the platform where the next ones are born",
    "time": "2025-07-12T16:00:00+01:00",
    "description": "The next wave of Web3 neobanks won’t be standalone apps; they'll be embedded within platforms people already use.",
    "date": "2025-07-12"
  },
  {
    "title": "How a teen stole $243M in Bitcoin and revealed his identity on livestream",
    "time": "2025-07-12T15:35:00+01:00",
    "description": "Veer Chetal, a 19-year-old hacker, used social engineering to steal $243 million in Bitcoin, then exposed his identity during a livestream and reoffended while out on bail.",
    "date": "2025-07-12"
  },
  {
    "title": "BlockFi bankruptcy administrator and DOJ agree to dismiss $35M lawsuit",
    "time": "2025-07-12T08:36:10+01:00",
    "description": "BlockFi’s bankruptcy administrator and the DOJ have settled a $35 million crypto asset transfer lawsuit.",
    "date": "2025-07-12"
  },
  {
    "title": "US Bitcoin ETFs record first back-to-back $1B inflows",
    "time": "2025-07-12T07:39:45+01:00",
    "description": "US-based spot Bitcoin ETFs saw over $1 billion in inflows on two straight days for the first time ever, as Bitcoin hit new all-time highs this week.",
    "date": "2025-07-12"
  },
  {
    "title": "Altcoins are rocketing, Bitcoin dominance hasn’t ‘even sneezed’: Analyst",
    "time": "2025-07-12T06:11:56+01:00",
    "description": "Crypto analyst Matthew Hyland suggests altcoins will be “ripping” much more when Bitcoin Dominance drops to 45%.",
    "date": "2025-07-12"
  },
  {
    "title": "Bitcoin Christmas rally to $200K or $300K possible based on ‘power law’ model",
    "time": "2025-07-12T00:23:12+01:00",
    "description": "Bitcoin’s parabolic rally could last until Christmas with a cycle top near $300,000, according to one analyst.",
    "date": "2025-07-12"
  },
  {
    "title": "Is the crypto market entering a new supercycle? Here are 5 ways to know",
    "time": "2025-07-11T20:34:36+01:00",
    "description": "As Bitcoin price hits new highs and altcoins soar, traders are curious to know if a new super cycle has begun.",
    "date": "2025-07-11"
  },
  {
    "title": "Despite record high, S&P 500 is down in Bitcoin terms",
    "time": "2025-07-11T19:08:05+01:00",
    "description": "The S&P 500 Index has staged a remarkable turnaround since April, but its performance still lags considerably behind BTC.",
    "date": "2025-07-11"
  },
  {
    "title": "Bitcoin $120K expectations add fuel to ETH, HYPE, UNI and SEI",
    "time": "2025-07-11T18:51:47+01:00",
    "description": "ETH, HYPE, UNI and SEI rallied toward new highs as Bitcoin pushed above $118,000.",
    "date": "2025-07-11"
  },
  {
    "title": "Grayscale calls out SEC delay of Digital Large Cap Fund ETF listing",
    "time": "2025-07-11T18:24:37+01:00",
    "description": "Attorneys for Grayscale argued that the US regulator's delay of the approval or disapproval decision clashes with existing statutes.",
    "date": "2025-07-11"
  },
  {
    "title": "How to use ChatGPT for crypto strategy, signals, and sentiment",
    "time": "2025-07-11T18:07:46+01:00",
    "description": "Use ChatGPT to summarize market news, interpret on-chain data, compare token metrics, and spot sentiment shifts using structured prompts.",
    "date": "2025-07-11"
  },
  {
    "title": "5 countries where crypto is (surprisingly) tax-free in 2025",
    "time": "2025-07-11T18:04:11+01:00",
    "description": "Looking to live tax-free with crypto in 2025? These five countries, including the Cayman Islands, UAE and Germany, still offer legal, zero-tax treatment for cryptocurrencies.",
    "date": "2025-07-11"
  },
  {
    "title": "HIVE Digital stock soars on BTC mining, revenue milestones",
    "time": "2025-07-11T16:18:50+01:00",
    "description": "The blockchain and AI infrastructure company has doubled its Bitcoin hashrate and boosted its annual revenue run rate to $250 million.",
    "date": "2025-07-11"
  },
  {
    "title": "How crypto scammers used dating apps to steal $36.9M and launder it to Cambodia",
    "time": "2025-07-11T15:05:00+01:00",
    "description": "                        Looking for love lost $36.9 million to crypto scammers: A story of how Axis Digital turned sweet words into stolen coins and laundered it all to Cambodia.                    ",
    "date": "2025-07-11"
  },
  {
    "title": "Peter Schiff says sell Bitcoin for silver as BTC smashes new highs",
    "time": "2025-07-11T13:23:14+01:00",
    "description": "Bitcoin’s latest rally sparked a reaction from Peter Schiff, urging a switch to silver, while others were more bullish than ever.",
    "date": "2025-07-11"
  },
  {
    "title": "Shanghai officials warm to stablecoins despite China crypto ban: Report",
    "time": "2025-07-11T12:18:15+01:00",
    "description": "Local authorities and state-owned publications in mainland China are increasingly calling on the government not to dismiss the increasing global adoption of stablecoins.",
    "date": "2025-07-11"
  },
  {
    "title": "The payment gateway that makes crypto actually work for businesses",
    "time": "2025-07-11T11:00:00+01:00",
    "description": "With integrated plugins for major e-commerce platforms like Shopify, businesses can activate crypto payments without complex technical setups.",
    "date": "2025-07-11"
  },
  {
    "title": "Can you earn passive income running a Lightning node?",
    "time": "2025-07-11T08:50:00+01:00",
    "description": "Running a Lightning Network node in 2025 can generate passive Bitcoin income, but success depends on capital, uptime and dynamic fee strategies.",
    "date": "2025-07-11"
  },
  {
    "title": "Bitcoin supply is shrinking: Will Saylor’s relentless BTC buying cause a supply shock?",
    "time": "2025-07-11T08:05:00+01:00",
    "description": "                        As Michael Saylor’s Strategy and other whales keep buying Bitcoin, the stage may be set for a historic supply shock.                    ",
    "date": "2025-07-11"
  },
  {
    "title": "Bitcoin, Ether ETFs clock second-biggest day of inflows on record",
    "time": "2025-07-11T07:58:07+01:00",
    "description": "BlackRock’s Bitcoin and Ether funds were the biggest beneficiaries of Thursday’s net inflows.",
    "date": "2025-07-11"
  },
  {
    "title": "Tasmanian police find top 15 crypto ATM users are scam victims",
    "time": "2025-07-11T07:20:20+01:00",
    "description": "Tasmanian police said they found victims were being directed to crypto ATMs by scammers after regular financial institutions flagged the transactions.",
    "date": "2025-07-11"
  },
  {
    "title": "‘Bears in disbelief’ — $1B in crypto shorts wiped as Bitcoin pumps",
    "time": "2025-07-11T05:42:35+01:00",
    "description": "Approximately 232,149 traders have been liquidated over the past 24 hours as the crypto market rallied to new highs.",
    "date": "2025-07-11"
  },
  {
    "title": "Florida probes Robinhood’s crypto trading promotion",
    "time": "2025-07-11T03:40:25+01:00",
    "description": "Lucas Moskowitz, Robinhood’s general counsel, told Cointelegraph that the platform’s “disclosures are best-in-class,” and “customers can trade crypto at the lowest cost on average”.",
    "date": "2025-07-11"
  },
  {
    "title": "SUI bullish chart pattern confirmation sets breakout target at $3.89",
    "time": "2025-07-10T23:30:00+01:00",
    "description": "SUI broke out of an inverse head-and-shoulders pattern, opening the door for a rally to $3.89.",
    "date": "2025-07-10"
  },
  {
    "title": "Why I won't invest in companies that ignore AI — Kevin O'Leary",
    "time": "2025-07-10T22:01:09+01:00",
    "description": "Ignoring the reduced customer acquisition costs made possible by AI places businesses at a significant disadvantage, O'Leary said.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoin price expected to accelerate if daily close above $113K is secured",
    "time": "2025-07-10T21:58:37+01:00",
    "description": "Bitcoin's market structure and the recent rally to new highs suggest an accelerated phase of price discovery has just begun.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoin price likely to hit $130K before serious profit taking kicks in",
    "time": "2025-07-10T20:43:38+01:00",
    "description": "Soaring capital inflows and an uptick in Bitcoin wallets identified as “accumulators” suggest BTC price is on a path to $130,900.",
    "date": "2025-07-10"
  },
  {
    "title": "10 public companies that quietly turned their balance sheets into Bitcoin treasuries",
    "time": "2025-07-10T19:55:48+01:00",
    "description": "While headlines focus on giants like Strategy and Tesla, companies like Aker ASA, Méliuz and Rumble have quietly added BTC to their balance sheets.",
    "date": "2025-07-10"
  },
  {
    "title": "How to legally stake crypto in 2025 under the SEC’s new rules",
    "time": "2025-07-10T19:36:19+01:00",
    "description": "The SEC’s 2025 guideline clarifies the regulatory stance regarding crypto staking. It states what is and isn’t allowed and how you can stake lawfully.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoin hits $113.8K all-time high as liquidity influx backs BTC price discovery",
    "time": "2025-07-10T19:28:44+01:00",
    "description": "Bitcoin price set new highs above $113,800 as stablecoin reserves surged and retail investor-driven selling subsided.",
    "date": "2025-07-10"
  },
  {
    "title": "India’s Bitcoin crossroads: Will it add BTC to national reserves?",
    "time": "2025-07-10T16:05:00+01:00",
    "description": "As the US and others explore Bitcoin reserves, India faces a pivotal choice: Can BTC boost macro resilience and digital leadership?",
    "date": "2025-07-10"
  },
  {
    "title": "Trump’s crypto agenda favors elites, not the everyday user",
    "time": "2025-07-10T16:00:00+01:00",
    "description": "Donald Trump’s crypto agenda claims to champion financial freedom, but the real beneficiaries are political insiders and wealthy elites.",
    "date": "2025-07-10"
  },
  {
    "title": "Bit Mining surges 350% on pivot to Solana, plans $300M token treasury",
    "time": "2025-07-10T14:58:05+01:00",
    "description": "Bit Mining’s stock price surged 350% in pre-market trading after announcing a strategic pivot into the Solana ecosystem.",
    "date": "2025-07-10"
  },
  {
    "title": "Malta’s MiCA licensing comes under scrutiny from EU regulator",
    "time": "2025-07-10T13:42:16+01:00",
    "description": "Malta’s MFSA only “partially met expectations” in the MiCA authorization process for a specific CASP, according to the EU securities regulator.",
    "date": "2025-07-10"
  },
  {
    "title": "Coinbase unlocks off-exchange settlement for institutions amid ‘high’ demand",
    "time": "2025-07-10T12:30:00+01:00",
    "description": "Coinbase has partnered with Copper to offer off-exchange settlement via ClearLoop, aiming to meet growing institutional demand for secure crypto trading.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoin treasury companies acquire record 159,107 BTC in Q2",
    "time": "2025-07-10T10:19:29+01:00",
    "description": "Corporate Bitcoin holdings surged in Q2, with companies adding a record 159,107 BTC, bringing total holdings to more than 847,000 BTC.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoin investors have now splashed over $50B on US spot ETFs",
    "time": "2025-07-10T07:16:33+01:00",
    "description": "BlackRock and Fidelity’s spot Bitcoin ETFs have led the charge, with momentum only slightly dented due to outflows from Grayscale's Bitcoin fund.",
    "date": "2025-07-10"
  },
  {
    "title": "Bitcoiners underprepared for possible $133K price tag in September",
    "time": "2025-07-10T07:07:55+01:00",
    "description": "10x Research’s Bitcoin trend model says there’s a 60% chance for Bitcoin to move higher over the next two months, with history pointing to a 20% gain.",
    "date": "2025-07-10"
  },
  {
    "title": "‘See you at $150K,’ says Bitcoin bull after BTC taps new highs",
    "time": "2025-07-10T04:09:10+01:00",
    "description": "Economist Timothy Peterson said that if Bitcoin hadn’t reclaimed its all-time high, the market might have had to wait until October for the next opportunity.",
    "date": "2025-07-10"
  },
  {
    "title": "Donald Trump Jr. invests in social media-turned BTC treasury firm",
    "time": "2025-07-09T22:26:44+01:00",
    "description": "The Thumzup Media Corporation provides a platform for influencers to market various products on social media to earn revenue.",
    "date": "2025-07-09"
  },
  {
    "title": "US debt rises to $36.6T: Will recession signals send Bitcoin back to $95K?",
    "time": "2025-07-09T22:00:00+01:00",
    "description": "Bitcoin price hit new highs today, but surging US debt and concerning housing data raise fears of a recession-led Bitcoin drop toward $95,000.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin soars to new all-time high above $112K as traders liquidate shorts",
    "time": "2025-07-09T21:10:22+01:00",
    "description": "Bitcoin price roared to a new all-time high above $112,000. Cointelegraph explains why.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin analyst warns time 'running out' for another BTC price parabolic rally",
    "time": "2025-07-09T16:20:00+01:00",
    "description": "Crypto analyst TradingShot says that while Bitcoin’s long-term outlook is still bullish, there might not be enough time for another leg up.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin to test $110K as macro analysis tells traders to 'buckle up'",
    "time": "2025-07-09T15:39:03+01:00",
    "description": "Bitcoin price performance frustrates bulls as $110,000 stays out of reach, but the clock is ticking to even more risk-asset volatility.",
    "date": "2025-07-09"
  },
  {
    "title": "Japanese firm Remixpoint raises $215M to expand Bitcoin treasury holdings",
    "time": "2025-07-09T15:23:26+01:00",
    "description": "Tokyo-listed energy and fintech firm Remixpoint has raised 31.5 billion Japanese yen ($215 million) to expand its Bitcoin treasury, aiming to accumulate 3,000 BTC.",
    "date": "2025-07-09"
  },
  {
    "title": "ChatGPT vs X: Which is better at first spotting the next big crypto narrative?",
    "time": "2025-07-09T14:16:02+01:00",
    "description": "Crypto traders use ChatGPT and X to catch early signals, combining AI-driven analysis with real-time sentiment. But each comes with its risks.",
    "date": "2025-07-09"
  },
  {
    "title": "Musk’s America Party may support Bitcoin but still faces third-party pitfalls",
    "time": "2025-07-09T14:00:11+01:00",
    "description": "Elon Musk says that his new America Party will support Bitcoin, but does it have a chance in the American political system?",
    "date": "2025-07-09"
  },
  {
    "title": "Emirates airline signs MoU with Crypto.com to enable crypto payments",
    "time": "2025-07-09T12:00:11+01:00",
    "description": "Emirates and Crypto.com will work together to introduce crypto payments and launch promotional campaigns to boost adoption.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin gets ‘highly favorable’ cues as DXY sets 21-year weakness record",
    "time": "2025-07-09T10:14:46+01:00",
    "description": "Bitcoin maintaining its inverse correlation to the US dollar means big wins on the horizon as the dollar strength DXY index trails below key moving averages.",
    "date": "2025-07-09"
  },
  {
    "title": "New Zealand bans crypto ATMs in crackdown on criminal cash conversions",
    "time": "2025-07-09T08:23:17+01:00",
    "description": "New Zealand banned crypto ATMs and set a $5,000 cap on overseas cash transfers in a major step to combat money laundering and financial crime.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin lacks ‘sustained momentum’ for new high as traders are hesitant",
    "time": "2025-07-09T07:17:26+01:00",
    "description": "Bitcoin traders are showing a “lack of follow-through strength” as BTC struggles to break its current all-time high level, says Bitfinex.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin lacked mass media coverage in Q2: Report",
    "time": "2025-07-09T05:11:44+01:00",
    "description": "Major news outlets The Wall Street Journal, the Financial Times and The New York Times published just 13 articles on Bitcoin in Q2, according to research from Perception.",
    "date": "2025-07-09"
  },
  {
    "title": "Crypto traders ‘starting to salivate’ as Bitcoin inches back toward $110K",
    "time": "2025-07-09T03:57:57+01:00",
    "description": "Santiment says the ratio of bullish to bearish Bitcoin comments on social media has hit a three-week high as traders grow more optimistic about Bitcoin breaking above $110,000.",
    "date": "2025-07-09"
  },
  {
    "title": "US sanctions North Korean tech worker crew over crypto thefts",
    "time": "2025-07-09T03:29:28+01:00",
    "description": "TRM Labs said North Korea is moving away from hacks to focus more on deception-based revenue generation, such as planting IT workers in US companies.",
    "date": "2025-07-09"
  },
  {
    "title": "Bitcoin metric says $100K BTC was the bottom: When will a rally to new highs start?",
    "time": "2025-07-09T00:00:00+01:00",
    "description": "Bitcoin’s inflow/outflow ratio fell to 2022 lows, and the cumulative volume delta shows short-selling pressure failing to push prices lower. Time for a rally?",
    "date": "2025-07-09"
  }
]