{
  "scraped_at": "2025-07-14T10:30:55.720242",
  "total_headlines": 29,
  "headlines": [
    {
      "headline": "As Bitcoin Rushes Past $122K, What's Next for Ether, XRP, Dogecoin?",
      "description": "“We could see Bitcoin test $130K–$150K by year-end if macro winds cooperate,” one trading desk said.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.215008"
    },
    {
      "headline": "Bearish Bitcoin Trader Loses $92M as Surge Wipes Out $426M in Short Liquidations",
      "description": "BTC alone saw $291 million in forced closures, with futures tracking ether (ETH) and XRP following at $68 million and $17 million, respectively.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.215334"
    },
    {
      "headline": "Bitcoin, Ether Traders Bet Big With Tuesday's U.S. Inflation Data Seen as Non-Event",
      "description": "BTC and ETH traders bet big through onchain and centralized options markets.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.215543"
    },
    {
      "headline": "Japan’s Metaplanet Buys 797 Bitcoin as BTC Breaks Past $120K",
      "description": "Metaplanet's strategy mirrors the blueprint used by Strategy (MSTR): accumulate bitcoin via equity and debt issuance, then use the asset base to secure financing for broader expansion.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.215749"
    },
    {
      "headline": "Chart of the Week: 'Hyperbitcoinization' May Not Be Just Maximalist Fantasy Anymore",
      "description": "As the bitcoin price breaks records and institutional demand ramps up, the once-theoretical endgame of hyperbitcoinization is starting to look more like a macro trend than just a crypto dream.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.216045"
    },
    {
      "headline": "Bitcoin Breaks $119K, While XLM and HBAR Lead Altcoin Rally",
      "description": "Although bitcoin's move on Sunday delighted bitcoiners, holders of two top 20 altcoins had even more reason to celebrate.",
      "date": "2025-07-14",
      "scraped_at": "2025-07-14T10:30:40.216250"
    },
    {
      "headline": "Bitcoin, Ether Tentative, XRP Steady as Trump Announces 30% Tariff on EU and Mexico",
      "description": "Major coins traded tentatively as Trump escalated trade tensions.",
      "date": "2025-07-12",
      "scraped_at": "2025-07-14T10:30:40.216454"
    },
    {
      "headline": "‘We Expect Bitcoin to Top $200K by the End of Year’, Says Bitwise CIO",
      "description": "With the bitcoin price reaching a new all-time high earlier this week, crypto industry leaders and analysts are starting to expect a lot more from BTC in 2025.",
      "date": "2025-07-12",
      "scraped_at": "2025-07-14T10:30:40.216654"
    },
    {
      "headline": "Defi Tokens Are Soaring, Leaving Behind OG Coins Like LTC, BCH and XMR",
      "description": "As bitcoin reaches a record high, tokens associated with DeFi and layer-2 networks are outperforming.",
      "date": "2025-07-11",
      "scraped_at": "2025-07-14T10:30:40.216941"
    },
    {
      "headline": "Bitcoin at High Leaves Crypto Stocks Mixed as Strategy, Galaxy Gain, Coinbase Falls",
      "description": "No description found",
      "date": "2025-07-11",
      "scraped_at": "2025-07-14T10:30:40.217158"
    },
    {
      "headline": "Bitcoin's 'Low Volatility' Rally From $70K to $118K: A Tale of Transition From Wild West to Wall Street-Like Dynamics",
      "description": "Bitcoin's recent bull run has been characterized by steady price increases and declining volatility, aligning more with traditional financial markets.",
      "date": "2025-07-11",
      "scraped_at": "2025-07-14T10:30:43.078630"
    },
    {
      "headline": "Bitcoin Rockets Past $118K, Leads to Over $1B Shorts Getting Liquidated",
      "description": "Roughly 237,000 traders were liquidated in total, with the single largest hit being an $88.5 million BTC-USDT short on HTX.",
      "date": "2025-07-11",
      "scraped_at": "2025-07-14T10:30:43.078946"
    },
    {
      "headline": "Bitcoin Hits New All-Time High at $116k, Nearly $1B Shorts Get Liquidated: Markets Liveblog",
      "description": "Analysts and longtime industry participants weigh in on how this week's bitcoin price action resembles — or differs from — past bull runs.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.079139"
    },
    {
      "headline": "Bitcoin Breaks Fresh Record Topping $116,000",
      "description": "The new all-time high on Thursday follows multiple attempts to break above the $112,000 level.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.079333"
    },
    {
      "headline": "Sequans Communications Kicks Off Bitcoin Treasury with 370 BTC Purchase",
      "description": "The semiconductor firm plans to expand holdings to 3,000 BTC using proceeds from recent its capital raise.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.079610"
    },
    {
      "headline": "Bitcoin's Q2 Boom Being Fueled by Corporates: Bitwise",
      "description": "Public companies expand bitcoin treasuries as participation soars.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.079808"
    },
    {
      "headline": "This One Metric Suggests Bitcoin Has Plenty of Room Left to Run",
      "description": "Despite new all-time highs, on-chain data signals the rally may be far from over.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.080003"
    },
    {
      "headline": "This Chart Points to a 30% Bitcoin Price Boom Ahead: Technical Analysis",
      "description": "IBIT's chart flashes a bullish pattern as BTC's spot price flirts with record highs.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.080195"
    },
    {
      "headline": "Shiba Inu Smashes Triangle Pattern Against Bitcoin, But Looks Weak Against Dogecoin",
      "description": "Institutional trading drove significant SHIB price gains, with strong resistance at around $0.00001250, CoinDesk's AI research noted.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.080469"
    },
    {
      "headline": "Bitcoin Bulls Increase Exposure as Trump's Pressure on Fed Pushes $15B Into BTC ETFs, Analyst Says",
      "description": "U.S.-listed spot bitcoin ETFs have attracted billions in investor capital over three months amid political pressure on the Federal Reserve to cut rates.",
      "date": "2025-07-10",
      "scraped_at": "2025-07-14T10:30:43.080664"
    },
    {
      "headline": "Bitcoin Tops $111K, on Brink of Breaking Record High; Ether's 6% Jump Leads Major Cryptos",
      "description": "The price of BTC has seemingly been capped at $110,000 for several weeks, with gains quickly reversing each time it approached that level.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.831503"
    },
    {
      "headline": "Cathie Wood's ARK: Bitcoin's Bullish Momentum Slows as Long-Term Holder Stacks Hit Record",
      "description": "ARK Invest's June report notes a 15-year high in holdings for long-term bitcoin holders amid declining new investor activity.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.831822"
    },
    {
      "headline": "Bitcoin Price Starts Surging After Trump Says 'Fed Rate' Is 300 Basis Points Too High",
      "description": "BTC jumped within 30 minutes of Trump’s rate-cut post as analysts weighed inflation risks and the impact of a potential 300 bp cut on asset prices.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.832026"
    },
    {
      "headline": "Patterns Break as Both Short and Long Term Holder Cohorts Accumulate Bitcoin",
      "description": "The stack sizes of long term and short term holders typically move in opposite directions.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.832226"
    },
    {
      "headline": "Anthony Pompliano’s ProCap Appears Better Than Peers Based on the BTC HODLer's Own Data",
      "description": "ProCap BTC, now the 13th largest public bitcoin holder, pursues $1 billion merger with CCCM, offering investors both downside protection and upside potential.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.832500"
    },
    {
      "headline": "Bitcoin Treasury Firms Expand War Chests as Global Adoption Rises",
      "description": "H100 Group, Remixpoint and LQWD Technologies secured new funding to boost BTC reserves, signaling growing corporate confidence in bitcoin treasuries.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.832692"
    },
    {
      "headline": "Key Market Dynamic Keeps Bitcoin, XRP Anchored to $110K and $2.3 as Ether Looks Prone to Volatility",
      "description": "Ether's recent price increase has pushed it into a negative gamma zone, which could increase its market volatility.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.832883"
    },
    {
      "headline": "Bitcoin, Ether, Solana, XRP ETFs See Record AUM as Traders Warn of ‘Summer Lull’",
      "description": "Ether-tracked products brought in $226 million, Solana $22 million, and XRP $11 million last week, bringing total ETF assets under management to an all-time high of $188 billion.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.833077"
    },
    {
      "headline": "Asia Morning Briefing: Bitcoin Stalls Near $109K as Market Waits for a Catalyst",
      "description": "As Bitcoin trades near highs, market flows are clustering into large caps and memes, with mid-tier tokens losing momentum, say market observers.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-14T10:30:45.833348"
    }
  ]
}