{
  "scraped_at": "2025-07-09T11:44:02.267666",
  "total_headlines": 200,
  "headlines": [
    {
      "headline": "Key Market Dynamic Keeps Bitcoin, XRP Anchored to $110K and $2.3 as Ether Looks Prone to Volatility",
      "description": "Ether's recent price increase has pushed it into a negative gamma zone, which could increase its market volatility.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.045113"
    },
    {
      "headline": "Bitcoin, Ether, Solana, XRP ETFs See Record AUM as Traders Warn of ‘Summer Lull’",
      "description": "Ether-tracked products brought in $226 million, Solana $22 million, and XRP $11 million last week, bringing total ETF assets under management to an all-time high of $188 billion.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.045436"
    },
    {
      "headline": "Asia Morning Briefing: Bitcoin Stalls Near $109K as Market Waits for a Catalyst",
      "description": "As Bitcoin trades near highs, market flows are clustering into large caps and memes, with mid-tier tokens losing momentum, say market observers.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.045643"
    },
    {
      "headline": "Bitcoin Bull Mulls Different Kind of Corporate Treasury Strategy as Prices Continue on Hold",
      "description": "Set for an IPO and with a real business, Silicon Valley darling Figma last week disclosed $70 million exposure to bitcoin, with plans to bring that to $100 million.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.045851"
    },
    {
      "headline": "BTC-Only VC Ego Death Capital Closes $100M Fund for Projects Building on Bitcoin",
      "description": "“We’re investing in businesses that treat Bitcoin not as a trade, but as infrastructure - something to build on, not bet on,” ego general partner Lyn Alden said",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.046137"
    },
    {
      "headline": "Japan's Surging 30-Year Yield Is Flashing Warning Sign for Risk Assets: Macro Markets",
      "description": "Market concerns about fiscal policy and upcoming elections may be contributing to the rise in bond yields.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.046341"
    },
    {
      "headline": "Metaplanet Wants to Use Bitcoin Holdings for Acquisitions: FT",
      "description": "Metaplanet is eyeing up \"phase two\" of its bitcoin treasury strategy, CEO Simon Gerovich said in an interview",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.046543"
    },
    {
      "headline": "Strategy Holds 11th Largest U.S. Corporate Treasury, Bitcoin Rivals Big Cash Reserves",
      "description": "The company’s bitcoin holdings rival cash positions of top U.S. corporates, with strong performance in preferred stock offerings.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.046745"
    },
    {
      "headline": "BlackRock iShares Bitcoin ETF Surges Past 700K BTC in Record-Breaking Run",
      "description": "BlackRock’s IBIT becomes third-largest revenue driver among nearly 1,200 funds as spot bitcoin ETFs reshape the investment landscape.",
      "date": "2025-07-09",
      "scraped_at": "2025-07-09T11:43:11.047030"
    },
    {
      "headline": "Crypto Traders Shrug Off Dormant Bitcoin Whale Moves, With Profit-Taking on XRP, DOGE, SOL",
      "description": "Musk mania, bullish options flows, and tariff delays keep crypto bid alive amid quiet summer trading.",
      "date": "2025-07-08",
      "scraped_at": "2025-07-09T11:43:11.047235"
    },
    {
      "headline": "Asia Morning Briefing: BTC’s Institutional Waves Are Building, Not Breaking",
      "description": "Despite short-term demand jitters, Saphira’s Jeff Dyment says BTC’s institutional adoption is accelerating in cyclical waves, not stalling, with options data backing up that thesis.",
      "date": "2025-07-08",
      "scraped_at": "2025-07-09T11:43:13.539791"
    },
    {
      "headline": "Real Estate Firm Murano to Build Bitcoin Treasury With $500M Equity Deal",
      "description": "The company, which operates hotels across Mexico, is also exploring ways to integrate BTC as a payment and loyalty rewards program for customers.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.540102"
    },
    {
      "headline": "Bitcoin Slips Below $108K, Erases Weekend Gains as Trump Ramps Up Tariffs",
      "description": "The president imposed 25% tariffs against Japan and Korea, while threatening additional levies against any countries aligning themselves with the BRICs nations.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.540290"
    },
    {
      "headline": "Threshold's Bitcoin Backed tBTC Debuts on Sui, Unlocking $500M in Liquidity",
      "description": "The collaboration allows Sui users to directly mint tBTC on the network.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.540473"
    },
    {
      "headline": "Strategy Books $14B Q2 Bitcoin Profit, Sets $4.2B STRD Preferred ATM Offering",
      "description": "The price of bitcoin rose roughly 30% during the three months ended June 30.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.540736"
    },
    {
      "headline": "Satoshi Era-Whale's $8B Bitcoin Move Could Be Linked to Wallet Security Upgrade: Arkham",
      "description": "The funds remain untouched in the new wallets, suggesting that the move was proactive and likely part of a broader operational security measure rather than a response to market activity.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.540924"
    },
    {
      "headline": "Bitcoin Whales Scoop Up BTC as Price Nears Record High in Sign of Growth Expectations",
      "description": "Large holders are accumulating aggressively while smaller investors are selling.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.541109"
    },
    {
      "headline": "Bitcoin's Potential Bull Market Resistance: $115K or $223K?",
      "description": "The analysis of linear and log-scaled price charts reveal potential resistance levels for BTC.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.541293"
    },
    {
      "headline": "The Blockchain Group Bolsters Bitcoin Reserves With $12.5M BTC Acquisition",
      "description": "European bitcoin treasury firm hits 1,904 BTC milestone with massive yield.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.541554"
    },
    {
      "headline": "Dogecoin Pops 6% to Lead Majors Gains as Bitcoin Nears $110K on Fresh Rate-Cut Optimism",
      "description": "“If we see a soft CPI print on Tuesday, that could open the door for a Fed rate cut later this year,” one trader said.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:13.541744"
    },
    {
      "headline": "Elon Musk Says America Party Will Embrace BTC as 'Fiat Is Hopeless'",
      "description": "The America Party formed out of a rift between Musk and President Trump over the 'Big Beautiful Bill'",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:16.070283"
    },
    {
      "headline": "Asia Morning Briefing: Michael Saylor's BTC Buys Aren't Making Up for Slowing Spot Demand, Say Analysts",
      "description": "Institutional bitcoin purchases are failing to offset a decline in spot market demand, raising concerns about BTC's near-term price momentum.",
      "date": "2025-07-07",
      "scraped_at": "2025-07-09T11:43:16.070567"
    },
    {
      "headline": "Bitcoin, Dogecoin, XRP Rise as Bessent Hints at Trade Deals Before Liberation Day Tariff Deadline",
      "description": "Bitcoin briefly topped $109,000, while XRP, Solana's SOL, and dogecoin saw notable gains.",
      "date": "2025-07-06",
      "scraped_at": "2025-07-09T11:43:16.070746"
    },
    {
      "headline": "Bitcoin's 'Mempool' Nearly Empty as Prices Trade Near Lifetime Highs",
      "description": "Almost all of Bitcoin's actual users have gone away, one observer said, warning of a major crisis.",
      "date": "2025-07-06",
      "scraped_at": "2025-07-09T11:43:16.070923"
    },
    {
      "headline": "Chart of the Week: Wall Street Has Claimed Bitcoin—Now What?",
      "description": "Bitcoin's correlation with U.S. equities is still very high, while it has almost zero relation to gold and USD.",
      "date": "2025-07-06",
      "scraped_at": "2025-07-09T11:43:16.071183"
    },
    {
      "headline": "U.S. Exceptionalism Is Alive and Well as Nasdaq Outperforms Global Peers: Macro Markets",
      "description": "The resurgence of U.S. exceptionalism may positively impact bitcoin and stabilize the U.S. dollar.",
      "date": "2025-07-05",
      "scraped_at": "2025-07-09T11:43:16.071383"
    },
    {
      "headline": "Drake Compares Fake Friends to Bitcoin's Volatility: ‘Down This Week, Up Next’",
      "description": "From rap verses to million-dollar crypto wagers, Drake’s high-stakes love affair with bitcoin keeps unfolding.",
      "date": "2025-07-05",
      "scraped_at": "2025-07-09T11:43:16.071571"
    },
    {
      "headline": "$8B BTC Movements May Have Been Preceded by Covert Bitcoin Cash Test",
      "description": "Eight wallets that had been dormant since 2011 each transferred 10,000 BTC to new SegWit addresses on Friday, over 14 years after initially receiving bitcoin in what is now colloquially known as the network’s “Satoshi era.”",
      "date": "2025-07-05",
      "scraped_at": "2025-07-09T11:43:16.071754"
    },
    {
      "headline": "Eight Bitcoin Wallets Move 80,000 BTC in Largest Ever ‘Satoshi Era’ Transfers",
      "description": "All of these moved coins are among the rarest class of BTC: mined or transacted during the “Satoshi era,” a loosely defined period from bitcoin’s launch in 2009 through 2011, when its pseudonymous creator was still active online.",
      "date": "2025-07-05",
      "scraped_at": "2025-07-09T11:43:16.072008"
    },
    {
      "headline": "Bitcoin Long-Term Holders Signal Patience in Market",
      "description": "Stubborn long-term supply hints at higher price targets despite recent selling.",
      "date": "2025-07-04",
      "scraped_at": "2025-07-09T11:43:16.072190"
    },
    {
      "headline": "Bitcoin on the Brink of All-Time High as Macro Tailwinds Gather Strength",
      "description": "Record equity markets, surging money supply and fiscal risks set the stage for a historic July rally in the largest cryptocurrency.",
      "date": "2025-07-04",
      "scraped_at": "2025-07-09T11:43:18.644500"
    },
    {
      "headline": "Bitcoin Whales Wake Up From 14-Year Slumber to Move Over $2B of BTC",
      "description": "The transfers showed no signs of a profit-taking operation.",
      "date": "2025-07-04",
      "scraped_at": "2025-07-09T11:43:18.644804"
    },
    {
      "headline": "Crypto ETF BLOX, Which Offers Digital Asset Exposure and Options Income, Gains Steam",
      "description": "Since its launch on June 18, the ETF has seen a net inflow of $4.52 million, with total assets under management nearing $4.9 million.",
      "date": "2025-07-04",
      "scraped_at": "2025-07-09T11:43:18.644994"
    },
    {
      "headline": "Traders Pile on Short Positions as Bitcoin Approaches All-Time High",
      "description": "The action suggests bitcoin's recent range — capped at around $110,000 to the upside — could continue.",
      "date": "2025-07-03",
      "scraped_at": "2025-07-09T11:43:18.645184"
    },
    {
      "headline": "Crypto Exchange Coinone Wins South Korean Court Battle Over Doubled Bitcoin Withdrawals",
      "description": "The court ruled the customers benefited from unjust enrichment due to a network delay, not the exchange’s servers.",
      "date": "2025-07-03",
      "scraped_at": "2025-07-09T11:43:18.645461"
    },
    {
      "headline": "U.S. June Jobs Data Blows Through Forecasts, With 147K Added, Unemployment Rate Falling to 4.1%",
      "description": "The strong numbers seemingly put to rest any idea that the Fed might cut rates in July.",
      "date": "2025-07-03",
      "scraped_at": "2025-07-09T11:43:18.645656"
    },
    {
      "headline": "A Major Currency Outpaces Bitcoin With More Possible Momentum Ahead: Macro Markets",
      "description": "As U.S. fiscal fears mount and ECB rate cuts near their end, the euro’s surprising rally is forcing global investors to rethink their dollar bets.",
      "date": "2025-07-03",
      "scraped_at": "2025-07-09T11:43:18.645850"
    },
    {
      "headline": "Bitcoin Futures Open Interest Surges Nearly 10% as BTC Eyes $110K",
      "description": "An uptick in open interest alongside a price rise is said to validate the uptrend.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:18.646042"
    },
    {
      "headline": "Bitcoin Rebounds Toward $110K, Presaging What Could Be a Volatile July",
      "description": "Lifting crypto sentiment today could be what's being touted as a strong debut for a Solana staking ETF.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:18.646316"
    },
    {
      "headline": "Bitcoin $200K Target Still in Play, Driven by ETF, Corporate Treasury Buying: StanChart",
      "description": "Bullish catalysts include sustained ETF inflows, corporate treasury adoption and U.S. regulatory moves, the report said.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:18.646510"
    },
    {
      "headline": "Genius Group Adds 20 Bitcoin, Targets 1K BTC Within Six Months",
      "description": "The previously roughed-up shares have been on a tear in recent weeks, now sporting more than a 100% year-to-date advance.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.171016"
    },
    {
      "headline": "Bitcoin DeFi Project BOB Launches BitVM Bridge Testnet",
      "description": "The testnet debuts with support from a host of major crypto firms who will be operating nodes on the BitVM bridge, such as Lombard, Amber Group and RockawayX",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.171350"
    },
    {
      "headline": "Bitcoin Bulls Should Be Wary of the Dollar Index's Death Cross: Technical Analysis",
      "description": "The dollar index tanked over 10% in the first half.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.171540"
    },
    {
      "headline": "Bitcoin Trades Within Descending Channel as CME Gap Gets Filled",
      "description": "Technical chart signals continued pressure but shallower dips hint at resilience.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.171728"
    },
    {
      "headline": "U.S. M2 Money Supply Hits Record High of Nearly $22T",
      "description": "Rising M2 tends to have a lagged effect on inflation, according to St. Louis Federal Reserve.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.172003"
    },
    {
      "headline": "Public Companies Buy More Bitcoin Than ETFs for Third Consecutive Quarter",
      "description": "Corporate treasuries are turning to bitcoin for strategic growth that outpaces traditional investment vehicles.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.172192"
    },
    {
      "headline": "Bitcoin CME Futures Premium Slides, Suggests Waning Institutional Appetite",
      "description": "The premium has dropped to lowest since October 2023, according to 10x Research.",
      "date": "2025-07-02",
      "scraped_at": "2025-07-09T11:43:21.172375"
    },
    {
      "headline": "Asia Morning Briefing: Leverage Meets Patience as Bitcoin Builds Toward a Breakout",
      "description": "PLUS: Another publicly listed tech company is building out a bitcoin treasury.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:21.172559"
    },
    {
      "headline": "Bitcoin Cash Surges 5%, Chalks Out Bullish Golden Cross Against BTC",
      "description": "The BCH/BTC pair has risen nearly 20% in four weeks, with a bullish golden crossover indicating potential for a bull market.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:21.172823"
    },
    {
      "headline": "Bitcoin Layer-2 Botanix Mainnet Debuts, Cuts Block Times to 5 Seconds",
      "description": "Botanix Labs has emphasized its decentralized governance. The launch coincides with its transition to being operated by a federation of 16 node operators",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:21.173010"
    },
    {
      "headline": "Dollar Index Suffers Worst Crash Since 1991; Bitcoin's 'Stochastic' Points to Possible Drop Below $100K: Technical Analysis",
      "description": "The dollar index's crash supports the long-term bull case in BTC. However, BTC's short-term technicals look bleak.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.729448"
    },
    {
      "headline": "Bitcoin Network Hashrate Declined in June as Miners Reacted to Recent Heatwave: JPMorgan",
      "description": "The fall in the monthly average network hashrate was a result of miners curtailing operations in response to the recent heatwave, the report said.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.729787"
    },
    {
      "headline": "The Blockchain Group Raises $13M to Advance Bitcoin Treasury Vision",
      "description": "Capital increase and convertible bonds attract key investors.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.729984"
    },
    {
      "headline": "BTC's 200-Week Average Rises to $50K to Suggest Long-Term Market Strength",
      "description": "Key technical indicators show strength for bitcoin as market consolidates. \nKey average rises to record valuation to suggest long-term market strength.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.730183"
    },
    {
      "headline": "Strategy's Perpetual Preferred Stocks May Be Front Running S&P 500 Inclusion",
      "description": "Bitcoin’s monthly record close sparks speculation around Strategy’s market moves, but interest rates may also be playing a role.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.730462"
    },
    {
      "headline": "Bitcoin Profit Taking Accelerates as BTC Realized Gain Jumps to $2.4B",
      "description": "Long-term holders have been selling their BTC as U.S.-listed spot bitcoin ETFs see continued inflows.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.730659"
    },
    {
      "headline": "Germany's Public Savings Bank Network Sparkassen to Offer Bitcoin Trading to Clients: Report",
      "description": "Clients will be allowed to trade BTC and ETH via their mobile banking app.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.730854"
    },
    {
      "headline": "Bitcoin ETP With DeFi Yield Goes Live in Europe",
      "description": "The Fineqia Bitcoin Yield ETP deploys the underlying assets in decentralized finance yield strategies to offer investors a return on BTC holdings.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.731050"
    },
    {
      "headline": "XRP, TRX, DOGE Lead Majors With Positive Funding Rates as Bitcoin's Traditionally Weak Quarter Begins",
      "description": "Perpetual funding rates indicate a bullish sentiment for top altcoins, with XRP showing the strongest demand.",
      "date": "2025-07-01",
      "scraped_at": "2025-07-09T11:43:23.731332"
    },
    {
      "headline": "Bitcoin Carried Crypto Markets in 2025's First Half as Altcoins Crumbled. What's Next?",
      "description": "Crypto stayed flat in a volatile first half of the year thanks to bitcoin. Meanwhile, Ethereum's ETH, Solana's SOL and small caps endured steep losses.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:23.731531"
    },
    {
      "headline": "Bhutan Possibly Readies $15M Bitcoin Sale as Holdings Near $1.3B",
      "description": "State-run wallets remain active while investors weigh potential sell pressure amid bitcoin price consolidation.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.274090"
    },
    {
      "headline": "Michael Saylor's Strategy Added 4,980 Bitcoin Last Week, Bringing Stack to 597,325 Coins",
      "description": "The fresh acquisition was funded mostly through sales of common stock with sales of preferred shares accounting for a modest proportion.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.274408"
    },
    {
      "headline": "Bitcoin-Gold Price Ratio's 10% Surge Greenlights Bullish Flag Pattern: Technical Analysis",
      "description": "The BTC-gold ratio increased by over 10% to 33.33 last week, marking its best performance in two months.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.274605"
    },
    {
      "headline": "Bitcoin Price Not Being Suppressed, Selling by Long-Term Holders, Checkmate Says",
      "description": "Long-term holders selling as market consolidates above $100,000.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.274800"
    },
    {
      "headline": "The Blockchain Group Bolsters Bitcoin Holdings and Capital Base",
      "description": "Europe’s first bitcoin treasury company reports soaring BTC gains and strategic share subscriptions.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.275082"
    },
    {
      "headline": "Bitcoin DEX Traders Position for Downside Volatility With $85K-$106K Puts, Derive Data Show",
      "description": "Traders chase downside bets in BTC, according to data shared by onchain options platform Derive.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.275282"
    },
    {
      "headline": "Crypto Market Maker Wintermute Snags Bitcoin Credit Line From Cantor Fitzgerald",
      "description": "The loan facility enhances Wintermute’s ability to hedge risks effectively across exchanges and maintain broad market coverage, said the firm’s CEO Evgeny Gaevoy.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.275479"
    },
    {
      "headline": "Bhutan Bets on Binance Pay to Power Crypto-Backed Tourism Economy",
      "description": "At the Digital Bhutan panel, co-hosted by Binance, officials laid out a clear vision: bring crypto out of theory and into everyday life.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.275676"
    },
    {
      "headline": "Metaplanet Acquires 1,005 Bitcoin, Issues $208M Bonds for Further BTC Buys",
      "description": "Last week, the fifth largest corporate bitcoin holder, announced it is raising $515 million from capital raises.",
      "date": "2025-06-30",
      "scraped_at": "2025-07-09T11:43:26.275953"
    },
    {
      "headline": "Bitcoin Jumps After Trump Says Growth Will Offset Deficits, Boosting Bull Case for BTC and Gold",
      "description": "Bitcoin rose 0.54% to $107,937 after analyst Will Clemente said Trump’s deficit comments reinforce the bull case for BTC and gold.",
      "date": "2025-06-29",
      "scraped_at": "2025-07-09T11:43:26.276153"
    },
    {
      "headline": "Bitcoin Treasury Corp Boosts Holdings to 771 BTC, Plans Lending After $51M Buy",
      "description": "The Toronto-listed firm plans to use its 771 Bitcoin trove for institutional lending.",
      "date": "2025-06-28",
      "scraped_at": "2025-07-09T11:43:28.983895"
    },
    {
      "headline": "Core Scientific Could Top $30 on CoreWeave Buyout Deal: Cantor Fitzgerald",
      "description": "A new Cantor Fitzgerald report argues that bitcoin miner Core Scientific is worth far more than the markets believe thanks to its strategic role in powering AI.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.984197"
    },
    {
      "headline": "Market Wrap: Crypto Markets Shrug Off New Trump Tariff Threat as July Deadline Looms",
      "description": "U.S. President Trump said that all trade discussions with Canada were being terminated.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.984380"
    },
    {
      "headline": "Nasdaq Hits Record While Bitcoin, Gold Remain Under Pressure After Latest Macro Data",
      "description": "Though old news, U.S. inflation numbers from May were disappointing.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.984561"
    },
    {
      "headline": "Short COIN/Long BTC Trade Will Be a Winner as Soaring Coinbase Nears Overvaluation: 10x Research",
      "description": "No description found",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.984820"
    },
    {
      "headline": "Bitcoin Miner Revenue Drops to 2-Month Low, but Selling Pressure Remains Absent: CryptoQuant",
      "description": "Miners are earning less than at any point this year, but they’re still holding onto their coins.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.985004"
    },
    {
      "headline": "Bitcoin Faces Weakest Monthly Growth Since July as Whales Counteract ETF Inflows",
      "description": "Mixed on-chain signals and highlight market uncertainty.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.985182"
    },
    {
      "headline": "Market Cap of Euro Stablecoins Surges to Nearly $500M as EUR/USD Rivals Bitcoin's H1 Gains",
      "description": "The combined market cap of EUR-pegged stablecoins has grown by 44%, with Circle's EURC leading the increase with a 138% rise.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.985360"
    },
    {
      "headline": "Bitcoin's Double Top Warrants Caution, But a Full-Blown Price Crash Seems Unlikely: Sygnum Bank",
      "description": "Bitcoin's potential double top above $100,000 raises caution, but a crash like 2022 is unlikely without a black swan event, Sygnum's Head of Investment Research Katalin Tischhauser told CoinDesk.",
      "date": "2025-06-27",
      "scraped_at": "2025-07-09T11:43:28.985620"
    },
    {
      "headline": "Bitcoin Holds Above $107K Ahead of Friday’s Big Options Expiry With $102K Max Pain Price",
      "description": "Put-call skews show no clear directional positioning for traders in the short-term.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:28.985816"
    },
    {
      "headline": "Lingerie Fighting Championships to Add $2M in Bitcoin to Treasury Ahead of Expansion to UK",
      "description": "The Las Vegas-based MMA league is embracing BTC ahead of its first events in England and Wales this July.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.539440"
    },
    {
      "headline": "Bitcoin Illiquid Supply Climbs to Over 14M BTC, Reflects Strong HODL Trend",
      "description": "Over 72 percent of circulating BTC is now illiquid, suggesting reduced sell-side pressure and potential bullish momentum.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.539745"
    },
    {
      "headline": "Bitcoin's Podium-Ready 'Bull Flag' Hints at Price Boom to $140K",
      "description": "Bitcoin's price chart shows a bull flag, a bullish continuation pattern.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.539933"
    },
    {
      "headline": "Semler Scientific Trades at Premium to Bitcoin Holdings for First Time in Three Weeks",
      "description": "The return to parity may be a signal the 15th-largest bitcoin treasury company will soon add to its BTC stash.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.540120"
    },
    {
      "headline": "Bitcoin's Bull Case Strengthens as Dollar Index Slides, Nvidia Hits Record High Amid Recession Cues",
      "description": "Bitcoin's price has rebounded nearly 10% from weekend lows, with traditional markets supporting the case for continued move higher.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.540387"
    },
    {
      "headline": "Bitcoin Nears $108K as Fed Rate Cut Bets Rise; Traders Eye Ether, Solana, Cardano",
      "description": "Bitcoin reclaimed $107,000 as retail and institutional flows return, with Powell’s rate-cut hints and risk-on sentiment lifting crypto markets.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.540576"
    },
    {
      "headline": "Metaplanet Overtakes Musk's Tesla, Becomes Fifth Largest Corporate Bitcoin Holder",
      "description": "The Tokyo-listed firm now holds 12,345 BTC.",
      "date": "2025-06-26",
      "scraped_at": "2025-07-09T11:43:31.540764"
    },
    {
      "headline": "Bitcoin Rises Past $107K as FHFA's Pulte Orders Crypto Consideration in Mortgage Applications",
      "description": "The Trump appointee overseeing the nation's housing agencies said Freddie Mac and Fannie Mae should take mortgage applicants' crypto holdings into account.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:31.540952"
    },
    {
      "headline": "GameStop Has Another $2.7B in Bitcoin Buying Power After $450M Greenshoe Exercise",
      "description": "The underwriters exercised their option to buy another $450 million of GME's $2.25 billion mid-June convertible debt offering.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:31.541219"
    },
    {
      "headline": "Anthony Pompliano's ProCap BTC Buys $128M of Bitcoin in 2nd Straight Day of Purchases",
      "description": "ProCap BTC bought 1,208 BTC, bringing its total to 4,932, with plans to scale up to $1 billion in bitcoin.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:31.541409"
    },
    {
      "headline": "XRP Primed for Record Rally, Echoing Bullish Bitcoin Pattern Ahead of $100K Breakout",
      "description": "The current XRP market situation mirrors bitcoin's chart before its late 2024 surge from $70,000 to $100,000.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:34.084824"
    },
    {
      "headline": "Deep Sea Mining Firm Goes Deep on Bitcoin With $1.2B BTC Treasury Plan",
      "description": "The Oslo-listed firm said it bought four bitcoin in its first BTC purchase.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:34.085137"
    },
    {
      "headline": "Metaplanet Raises $515M, Blockchain Group Adds $4.8M in Bitcoin Treasury Equity Moves",
      "description": "The Japanese and French companies executed major capital raises to fund bitcoin accumulation strategies amid growing institutional interest in BTC investment.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:34.085332"
    },
    {
      "headline": "Bitcoin's Upcoming $14B Options Expiry Marked by Surge in Put-Call Ratio. What Does It Indicate?",
      "description": "Quarterly settlements tend to breed market volatility.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:34.085531"
    },
    {
      "headline": "Asia Morning Briefing: Analysts Say BTC’s Long-Term Focus Is Easing War Jitters",
      "description": "PLUS: Tim Draper sees parallels between the flight to BTC and Microsoft's early days.",
      "date": "2025-06-25",
      "scraped_at": "2025-07-09T11:43:34.085817"
    },
    {
      "headline": "Pompliano’s ProCap Buys 3,724 Bitcoin After Raising $750M War Chest",
      "description": "The bitcoin-native company bought the coins at an average price of $103,785 and plans on leveraging its holding in yield-generating strategies.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:34.086018"
    },
    {
      "headline": "Strategy Stock Volatility Sinks to Historic Lows, Possibly Making Shares Less Attractive",
      "description": "Michael Saylor has pointed to high volatility as a reason for owning MSTR, so without it, the stock could suffer.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:34.086215"
    },
    {
      "headline": "Bitcoin Set for Biggest Mining Difficulty Drop Since July 2021",
      "description": "Bitcoin's hashrate collapse triggers a projected 9% difficulty adjustment, offering miners temporary relief amid seasonal and post-halving pressure.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:34.086411"
    },
    {
      "headline": "Nasdaq Futures Chalk Out Golden Cross Near Record High, Offering Bullish Cues to Bitcoin",
      "description": "Nasdaq and bitcoin often move together, suggesting the golden cross could encourage bitcoin bulls.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:34.086687"
    },
    {
      "headline": "U.S. Housing Regulator Could Let Crypto Be Considered in Mortgage Applications",
      "description": "Director Bill Pulte said that the FHFA will examine whether cryptocurrency holdings should help when it comes to U.S. home loans.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:34.086884"
    },
    {
      "headline": "Metaplanet Plans to Inject $5B Into U.S. Unit to Accelerate Bitcoin Buying Strategy",
      "description": "Capital contribution aims to fast-track Bitcoin accumulation and strengthen Metaplanet's global treasury footprint.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:36.633146"
    },
    {
      "headline": "Bitcoin Could Spike to $120K, Here Are 4 Factors Boosting the Case for a BTC Bull Run",
      "description": "Multiple analysts have repeatedly pointed to $120K as bitcoin's price target this year.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:36.633462"
    },
    {
      "headline": "Ether, Solana, Cardano Spike 7% as Trump Claims to Broker Israel-Iran Ceasefire",
      "description": "Crypto markets bounce back after Trump’s surprise ceasefire announcement cools geopolitical tensions; traders eye altcoin rotation as weekend liquidations subside.",
      "date": "2025-06-24",
      "scraped_at": "2025-07-09T11:43:36.633658"
    },
    {
      "headline": "Bitcoin Busts Past $106K on Reported Iran/Israel Ceasefire",
      "description": "President Trump claimed a \"complete and total\" ceasefire between Iran and Israel to begin in several hours.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.633854"
    },
    {
      "headline": "BTC Bounces Back Above $102K After Iranian Strikes on U.S. Bases in the Gulf",
      "description": "Crypto investors don't seem fazed by the attacks.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.634139"
    },
    {
      "headline": "Bitcoin Bounce Fails, Tumbling Below $100K as Iran Reportedly Prepares Retaliation Against U.S.",
      "description": "Axios reported the White House is expecting an Iranian attack against U.S. bases in the Gulf region.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.634339"
    },
    {
      "headline": "Brazil’s Méliuz Buys $28.6M in Bitcoin, Becomes Top Public BTC Holder in Latin America",
      "description": "The company reported a BTC yield of 908%, ranking it among the largest among bitcoin treasury companies.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.634538"
    },
    {
      "headline": "Trump Media Share Buyback to be Funded Separately From BTC Treasury Strategy",
      "description": "Trump Media recently raised more than $2 billion from around 50 institutional investors to create a BTC treasury.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.634738"
    },
    {
      "headline": "Cardone Capital Adds 1,000 BTC, Eyes 3,000 in Bold Bitcoin Strategy",
      "description": "The real estate mogul integrated $100 million in BTC into his firm's balance sheet, eyeing more crypto-backed growth.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.635019"
    },
    {
      "headline": "5G Chipmaker Sequans Joins the Bitcoin Treasury Strategy Rush",
      "description": "Shares of the Paris-based company are higher by 14% in premarket New York action.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:36.635220"
    },
    {
      "headline": "Strategy Added 245 Bitcoin to Holdings Last Week",
      "description": "The modest $26 million purchase was funded with preferred share sales.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:39.194559"
    },
    {
      "headline": "Bitcoin Bounces After War-Driven Dip, $98.2K Emerges as Key Level to Maintain Bullish Momentum",
      "description": "Geopolitical tensions spark weekend volatility but BTC bounces back maintaining critical on-chain support.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:39.194870"
    },
    {
      "headline": "Bitcoin Week Ahead: Focus on Powell's Testimony, U.S. Core PCE as Tariff Deadline Looms",
      "description": "Friday's core PCE release is likely to show price pressures easing, but there is a fix.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:39.195065"
    },
    {
      "headline": "Metaplanet Buys 1,111 Bitcoin for $117M, Pushes Total Holdings to Over 11K BTC",
      "description": "The firm's latest batch of buys was made at an average buying price of over $105,000 per bitcoin.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:39.195259"
    },
    {
      "headline": "Bitcoin Holds Key Support; Oil Disappoints 'Doomers' as Brent and WTI Erase Early Price Gains",
      "description": "Iran's threat to close the Strait of Hormuz is largely rhetorical, an energy market expert said.",
      "date": "2025-06-23",
      "scraped_at": "2025-07-09T11:43:39.195536"
    },
    {
      "headline": "Bitcoin Price Slips Below $100K, Hinting Oil-Led Risk-Off on Wall Street",
      "description": "Bitcoin fell below $100,000 on Sunday, its lowest point since May 8. XRP, ETH and SOL followed suit.",
      "date": "2025-06-22",
      "scraped_at": "2025-07-09T11:43:39.195732"
    },
    {
      "headline": "Bitcoin Rallies Above $102K After Panic Sellers Dump Into War Fears",
      "description": "Bitcoin fell to $101K before reversing sharply with high-volume support, as hedge fund James Lavish rebukes war-driven selling.",
      "date": "2025-06-22",
      "scraped_at": "2025-07-09T11:43:39.195928"
    },
    {
      "headline": "The Probability of Iran Blocking Strait of Hormuz Surges to 52% On Polymarket After Trump's Air Strikes on Iran's Nuclear Facility",
      "description": "BTC held above $100K, continuing its boring multi-week rangeplay.",
      "date": "2025-06-22",
      "scraped_at": "2025-07-09T11:43:39.196127"
    },
    {
      "headline": "Czech Government Survives No-Confidence Vote Over $45M Bitcoin Donation",
      "description": "Lawmakers rejected an attempt to oust Prime Minister Fiala after a controversial $45M bitcoin donation to the state was accepted.",
      "date": "2025-06-21",
      "scraped_at": "2025-07-09T11:43:39.196404"
    },
    {
      "headline": "What Are Savvy Bitcoin and Ether Traders Preparing for as Summer Approaches?",
      "description": "Traders are seemingly shoring up their defenses.",
      "date": "2025-06-21",
      "scraped_at": "2025-07-09T11:43:39.196600"
    },
    {
      "headline": "Bitcoin Falls Below $104K as Retail Investor Sentiment Returns to Liberation Day Levels",
      "description": "Bitcoin dipped below $104,000 following a 4% drop, even as analysts say extreme bearish sentiment from retail may hint at a rebound.",
      "date": "2025-06-21",
      "scraped_at": "2025-07-09T11:43:41.773927"
    },
    {
      "headline": "Bitcoin Quickly Plunges Below $103K, With Volatility Burst Spurring $450M in Crypto Liquidations",
      "description": "The sharp reversal from above $106,000 wiped out early optimism, with bulls and bears mostly continuing in a stalemate.",
      "date": "2025-06-20",
      "scraped_at": "2025-07-09T11:43:41.774248"
    },
    {
      "headline": "Peter Schiff Says He 'Gets Bitcoin' but Not USD-Pegged Stablecoins, Floats Gold-Backed Token Plan",
      "description": "The vocal crypto and bitcoin critic advocated for gold-backed stablecoins instead of U.S. dollar-pegged ones, and he plans to launch one himself.",
      "date": "2025-06-20",
      "scraped_at": "2025-07-09T11:43:41.774449"
    },
    {
      "headline": "KindlyMD Raises Another $51.5M for Bitcoin Treasury Strategy",
      "description": "The latest round brings the company's total capital raised to $763 million ahead of its merger with bitcoin-focused Nakamoto Holdings.",
      "date": "2025-06-20",
      "scraped_at": "2025-07-09T11:43:41.774645"
    },
    {
      "headline": "Bitcoin Steady Above $104K as Traders Eye Historically Bullish Second Half",
      "description": "“BTC continues to consolidate bullishly, and a move through recent highs could set up a run toward $145,000,” one trader opined.",
      "date": "2025-06-20",
      "scraped_at": "2025-07-09T11:43:41.774926"
    },
    {
      "headline": "Crypto Exchange Kraken Adds Bitcoin Staking Via Babylon as BTC Driven DeFi Picks Up",
      "description": "Kraken users will now be able to stake their bitcoin directly, locking it in a custodial vault on the native chain.",
      "date": "2025-06-19",
      "scraped_at": "2025-07-09T11:43:41.775123"
    },
    {
      "headline": "Return of Zero Interest Rate Policy as Swiss Central Bank Cuts Rates",
      "description": "The return to zero comes as tariffs threaten to deflate nations with trade surplus, such as Switzerland and China.",
      "date": "2025-06-19",
      "scraped_at": "2025-07-09T11:43:41.775321"
    },
    {
      "headline": "Ether, Solana, and Other Majors Could Slide Further as Trump Threatens Iran Strikes",
      "description": "Tensions in the Middle East are fueling a flight to safety, with traders rotating out of altcoins into stablecoins and bitcoin amid uncertainty around U.S. military escalation and sticky inflation.",
      "date": "2025-06-19",
      "scraped_at": "2025-07-09T11:43:41.775516"
    },
    {
      "headline": "Who's Selling Bitcoin Above $100K and Holding Back the Price Rally?",
      "description": "It's been a record 42 straight days of back-and-forth trading above the $100K mark.",
      "date": "2025-06-19",
      "scraped_at": "2025-07-09T11:43:41.775793"
    },
    {
      "headline": "Fed Leaves Rates Steady, Expects Weaker Growth, Sticky Inflation",
      "description": "Bitcoin price was little changed and traded just above $104,000 as policymakers expect stickier inflation and slower growth.",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:41.775990"
    },
    {
      "headline": "Bitcoin DeFi Project Elastos Debuts BTC-Backed Stablecoin BTCD",
      "description": "BTCD developer Elastos' aim is to create a digital version of the Bretton Woods system, with BTC at its core rather than gold.",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.453545"
    },
    {
      "headline": "Bitcoin Retests 50-Day Average Support; XRP Risks Dogecoin-Like Bearish Shift in Momentum",
      "description": "A failure to hold the recent strong support of the 50-day SMA could invite stronger selling pressure.",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.453856"
    },
    {
      "headline": "Bitcoin 'Accumulator' Better Fit for Corporates Than Dollar-Cost Averaging Strategy, Research Suggests",
      "description": "While investors of all kinds widely prefer DCA, new research shows that since 2023, it has underperformed a structured product called an \"accumulator.\"",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.454043"
    },
    {
      "headline": "Spain's BBVA Is Advising Clients to Invest Up to 7% of Portfolio in BTC, ETH: Reuters",
      "description": "The bank's head of blockchain solutions Philippe Meyer told the DigiAssets conference in London that it started advising on bitcoin in September last year",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.454223"
    },
    {
      "headline": "The Blockchain Group Adds 182 Bitcoin, Lifts BTC Holdings to Over $170M",
      "description": "The company says it achieved a 1,173% BTC yield this year as it accumulates more bitcoin.",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.454477"
    },
    {
      "headline": "Bitcoin Traders’ Are Looking at a Key Data Point in Fed Meeting and It's Not Interest Rate Decision",
      "description": "The Federal Reserve is expected to keep interest rates unchanged, with a decision announcement scheduled for Wednesday at 18:00 UTC.",
      "date": "2025-06-18",
      "scraped_at": "2025-07-09T11:43:44.454655"
    },
    {
      "headline": "Bitcoin Heads Lower as Trump Threatens to Assassinate Iran’s Supreme Leader",
      "description": "The U.S. President has called for Iran's unconditional surrender.",
      "date": "2025-06-17",
      "scraped_at": "2025-07-09T11:43:44.454839"
    },
    {
      "headline": "Bitcoin Cash-Bitcoin Ratio Smashes Triangle Pattern; HYPE Rally May Be Over",
      "description": "Bitcoin cash has broken out of a triangle pattern against bitcoin.",
      "date": "2025-06-17",
      "scraped_at": "2025-07-09T11:43:44.455030"
    },
    {
      "headline": "Deribit Sees Strong Demand From Institutions, Volume on Its Block RFQ Tool Reaches $23B in Four Months",
      "description": "The percentage of block trades via Deribit's RFQ increased to 27.5% this month, reflecting strong institutional demand.",
      "date": "2025-06-17",
      "scraped_at": "2025-07-09T11:43:44.455292"
    },
    {
      "headline": "XRP Leads Crypto Majors Gains as Bitcoin Is Continuously Tested by Israel-Iran Tensions",
      "description": "Analysts are eyeing this week’s Federal Reserve meeting for a decision on rate cuts, as well as cues on bitcoin's movements, with no policy changes expected.",
      "date": "2025-06-17",
      "scraped_at": "2025-07-09T11:43:44.455472"
    },
    {
      "headline": "BTC Tops $108K on JPMorgan Crypto Filing, XRP Rallies on ETF News",
      "description": "The crypto market was unfazed by the escalating conflict in the Middle East on Monday.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.486520"
    },
    {
      "headline": "Bitcoin Mining Costs Soar as Hashrate Hits Records: TheMinerMag",
      "description": "Public miners race to scale as Bitcoin’s hashrate nears the zetahash threshold.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.486853"
    },
    {
      "headline": "Strategy Adds Over 10K BTC to Its Bitcoin Treasury, Funded by New STRD Offering",
      "description": "Firm raises over $1 billion from high-yield preferred stock and share sales to expand record BTC holdings.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.487061"
    },
    {
      "headline": "Pakistan Engages Michael Saylor in Bold Push Toward Bitcoin-Backed Economy",
      "description": "High-level talks highlight Pakistan’s ambitions to lead digital asset adoption in the Global South and position Bitcoin as a tool for economic resilience.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.487267"
    },
    {
      "headline": "H100 Group Targets $79 Million Raise to Power Bitcoin Strategy",
      "description": "Blockstream CEO shares details with CoinDesk on strategic convertible loan backing bitcoin-focused treasury play.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.487567"
    },
    {
      "headline": "Metaplanet Overtakes Coinbase With 10K BTC, Becomes No. 9 Bitcoin Holder",
      "description": "The Tokyo-based company bought another 1,112 BTC for $117.2 million.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.487775"
    },
    {
      "headline": "Bitcoin Price Volatility Signal Goes Off – Is a Surge Ahead?",
      "description": "The volatility signal is based on the \"MACD\" linked to standard deviation bands.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.487982"
    },
    {
      "headline": "Asia Morning Briefing: Risk of Escalating Israel-Iran Conflict Keeps BTC Around 105K Says QCP",
      "description": "However, other data from Glassnode suggests that investor demand for BTC remains solid.",
      "date": "2025-06-16",
      "scraped_at": "2025-07-09T11:43:47.488190"
    },
    {
      "headline": "Chart of the Week: Bitcoin's Summer Lull Still Offers 'Inexpensive' Trading Opportunity",
      "description": "NYDIG Research said playing the low volatility through BTC options might yield a \"relatively inexpensive\" trade for directional traders.",
      "date": "2025-06-15",
      "scraped_at": "2025-07-09T11:43:47.488483"
    },
    {
      "headline": "Owning One Bitcoin Is the New American Dream, Says Bitwise Portfolio Manager",
      "description": "Bitcoin rebounded from a Middle East selloff and now trades above $105K, as long-term conviction strengthens among younger investors embracing its global ethos.",
      "date": "2025-06-15",
      "scraped_at": "2025-07-09T11:43:47.488692"
    },
    {
      "headline": "Bitcoin Remains Defiant Amid Escalating Middle East Conflict and Trade War Fears",
      "description": "Bitcoin dipped below $105K overnight before steadying as traders weigh geopolitical fallout and tariff uncertainty.",
      "date": "2025-06-14",
      "scraped_at": "2025-07-09T11:43:50.024359"
    },
    {
      "headline": "Bitcoin Bounces to $106K After Iran-Israel Jitters, but Analysts Warn of Deeper Pullback",
      "description": "Circle is up 13% on news that Amazon and Walmart are moving into stablecoins.",
      "date": "2025-06-13",
      "scraped_at": "2025-07-09T11:43:50.024677"
    },
    {
      "headline": "Brazilian Firm Meliuz's Shares Fall After Planning to Raise $32.4M to Buy Bitcoin",
      "description": "The fintech company strengthened its crypto strategy with a discounted share offering and a bitcoin acquisition plan.",
      "date": "2025-06-13",
      "scraped_at": "2025-07-09T11:43:50.024884"
    },
    {
      "headline": "Anthony Pompliano Set to Head $750M Bitcoin Investment Vehicle: FT",
      "description": "The crypto advocate is preparing to lead ProCapBTC in bid to mirror the bitcoin treasury strategy pioneered by Strategy's Michael Saylor, the Financial Times reported.",
      "date": "2025-06-13",
      "scraped_at": "2025-07-09T11:43:50.025084"
    },
    {
      "headline": "Single Bitcoin Trader Loses $200M as Crypto Bulls See $1B Liquidations",
      "description": "Massive liquidations dampened bullish momentum from Circle’s IPO and revived optimism around DeFi tokens, as over 247,000 traders were wiped out.",
      "date": "2025-06-13",
      "scraped_at": "2025-07-09T11:43:50.025366"
    },
    {
      "headline": "Bitcoin 'Skew' Slides as Oil Prices Surge 6% on Israel-Iran Tensions",
      "description": "Bitcoin's price fell to its 50-day simple moving average, while oil prices surged due to geopolitical tensions.",
      "date": "2025-06-13",
      "scraped_at": "2025-07-09T11:43:50.025557"
    },
    {
      "headline": "Crypto Cracks Late in Day, Bitcoin Slumps Below $106K",
      "description": "Troubling macro headlines concerning the Middle East and tariffs failed to shake U.S. stocks, but cryptocurrencies sold off.",
      "date": "2025-06-12",
      "scraped_at": "2025-07-09T11:43:50.025747"
    },
    {
      "headline": "Bitcoin Will Rally as U.S. Growth Improves, Crypto Bills Progress: Coinbase Research",
      "description": "U.S. economic resilience and stablecoin legislation will drive optimism for BTC, with the fate of altcoins being less certain.",
      "date": "2025-06-12",
      "scraped_at": "2025-07-09T11:43:50.025941"
    },
    {
      "headline": "Dollar Index Falls Below 98 for First Time in Three Years, Gives Room for Crypto Run",
      "description": "Weaker dollar sparks optimism for risk assets as inflation eases.",
      "date": "2025-06-12",
      "scraped_at": "2025-07-09T11:43:50.026211"
    },
    {
      "headline": "Strategy Launches STRD, Its Third 'Bitcoin-Backed' Preferred Stock on Nasdaq",
      "description": "New 10% yield offering aims to raise nearly $1 billion to support Strategy’s continued bitcoin accumulation. \nNew 10% yield offering aims to raise nearly $1 billion to support Strategy’s continued bitcoin accumulation.",
      "date": "2025-06-12",
      "scraped_at": "2025-07-09T11:43:50.026401"
    },
    {
      "headline": "Mercurity Fintech Plans $800M Bitcoin Treasury, Eyes Russell 2000 Inclusion",
      "description": "The company, which operates cryptocurrency mining facilities and offers financial services, did not disclose how ti plans on raising the funds.",
      "date": "12 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.552439"
    },
    {
      "headline": "Bitcoin, Dogecoin, Ether Could See Profit-Taking Even as Macro Conditions Improve",
      "description": "Tokens flash early signs of a local top as traders eye rotation and macro cues, despite optimism around ETFs, stablecoins and broader adoption.",
      "date": "12 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.552775"
    },
    {
      "headline": "Bitcoin at $200K by Year-End Is Now Firmly in Play, Analyst Says After Muted U.S. Inflation Data",
      "description": "The CPI missed estimates Wednesday, easing concerns of a tariff-led upswing in price pressures.",
      "date": "12 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.552991"
    },
    {
      "headline": "GameStop Raising Another $1.75B for Potential Bitcoin Purchases",
      "description": "The company made its initial acquisitions of bitcoin in May, buying 4,710 coins for about $500 million.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.553205"
    },
    {
      "headline": "Financial Advisors Remain Hesitant Towards Bitcoin — But Won’t Be for Long",
      "description": "Questions have evolved from “What is bitcoin?” to “How does it fit in my portfolio?”",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.553502"
    },
    {
      "headline": "U.S. Strategic Bitcoin Reserve Marks Milestone in Institutional Adoption: Gemini",
      "description": "More than 30% of the circulating bitcoin supply is now held by centralized entities including exchanges, ETFs, companies and sovereigns, the report said.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.553706"
    },
    {
      "headline": "Sweden's H100 Group Rallies Another 30% After Raising $10M for Bitcoin Treasury Strategy",
      "description": "Bitcoin OG Adam Back was among the investors in the health and longevity company's capital raise.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.553910"
    },
    {
      "headline": "Paul Tudor Jones Says Bitcoin Should Be in Every Portfolio as U.S. Debt Mounts",
      "description": "The billionaire investor sees bitcoin, gold and stocks as keys to protecting wealth in an inflationary era.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.554117"
    },
    {
      "headline": "Bitcoin Holder GameStop Gets an ETF From Bitwise",
      "description": "The crypto-focused asset manager is offering a covered call strategy to provide share price exposure to GME while generating income.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.554394"
    },
    {
      "headline": "U.S. CPI Rose Softer Than Expected 0.1% in May, Sending Bitcoin Higher",
      "description": "The core rate rose just 0.1% as well, far less than the 0.3% forecast.",
      "date": "11 июн. 2025 г.",
      "scraped_at": "2025-07-09T11:43:52.554594"
    },
    {
      "headline": "Crypto Exchange Bullish Files for U.S. IPO as Digital Asset Enthusiasm Mounts: FT",
      "description": "Bullish filed confidential papers with the SEC as the Trump administration eases regulations and promotes digital assets.",
      "date": "2025-06-11",
      "scraped_at": "2025-07-09T11:43:55.109732"
    },
    {
      "headline": "Ether, Dogecoin Surge, Outpaces Bitcoin as DeFi Comments Spurs Bullish Mood",
      "description": "Ether outpaces bitcoin on fresh institutional inflows and rising demand for tokenization, signaling a potential push towards its all-time high.",
      "date": "2025-06-11",
      "scraped_at": "2025-07-09T11:43:55.110045"
    },
    {
      "headline": "Bitcoin Rises to $110K as Altcoins Rally; Traders Skeptical of Breakout",
      "description": "Positioning across crypto markets doesn't suggest a top, but neither does it seem ideal for continued rally.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.110244"
    },
    {
      "headline": "Cathie Wood's ARK Invest: Bitcoin Gains Coming Alongside Clear Stress in Housing, Autos",
      "description": "Bitcoin's current rally doesn’t yet reflect speculative excess, the asset manager said in a new report.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.110444"
    },
    {
      "headline": "Negative Rates Return to Switzerland as U.S. Faces Higher Yields. What Does it Mean for Bitcoin?",
      "description": "The divergence in bond yields likely represents the perceived effects of Trump's trade war and could bode well for bitcoin.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.110724"
    },
    {
      "headline": "Ether More Favored by Traders as Volatility Against Bitcoin Hits Highest Since FTX Crash",
      "description": "ETH call options are trading at a higher premium on Deribit, making it more favorable to traders.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.110922"
    },
    {
      "headline": "Growing Stacks of Bitcoin Long-Term Holders Signals Bullish Outlook",
      "description": "As the bitcoin counts of long-term holders has increased, that of short-term holders has fallen.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.111119"
    },
    {
      "headline": "Bitcoin Core 30 to Increase OP_RETURN Data Limit After Developer Debate Concludes",
      "description": "Bitcoin Core 30 is scheduled to be implemented in October.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.111315"
    },
    {
      "headline": "Strategy Shifts Capital Raise to Preferred Stocks as Common Share Issuance Loses Allure",
      "description": "Sales of STRK and STRF preferred shares allow Strategy to fund bitcoin purchases without diluting common shareholders.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.111599"
    },
    {
      "headline": "Riot Sells $1.58M of Bitfarms Shares as Part of Investment Review",
      "description": "U.S.-based miner retains over 14% ownership after open market sales.",
      "date": "2025-06-10",
      "scraped_at": "2025-07-09T11:43:55.111797"
    },
    {
      "headline": "Bitcoin Climbs Above $110K, 'At Crossroads' for Next Major Move",
      "description": "One analyst characterized bitcoin's recovery from last week's decline as a \"peaceful rally,\" with buyers stepping in to support the uptrend.",
      "date": "2025-06-09",
      "scraped_at": "2025-07-09T11:43:57.659226"
    },
    {
      "headline": "Paraguay President's X Account Hacked, Shares Bitcoin Scam",
      "description": "Santiago Peña's account said that bitcoin would be made legal tender.",
      "date": "2025-06-09",
      "scraped_at": "2025-07-09T11:43:57.659536"
    },
    {
      "headline": "Michael Saylor's Strategy Added 1,045 Bitcoin for $110M Last Week",
      "description": "The company now holds a total of 582,000 tokens purchased at an average price of just over $70,000 each.",
      "date": "2025-06-09",
      "scraped_at": "2025-07-09T11:43:57.659723"
    },
    {
      "headline": "The Blockchain Group Starts 300M-Euro ATM Share Sale to Expand Bitcoin Holdings",
      "description": "The program allows French asset manager TOBAM to buy shares at its discretion, potentially increasing its shareholding to as much as 39%. It currently holds 3%.",
      "date": "2025-06-09",
      "scraped_at": "2025-07-09T11:43:57.659911"
    },
    {
      "headline": "Bitcoin Struggles as Hang Seng Cheers U.S.-China Trade Talks; U.S. Inflation Eyed",
      "description": "Hong Kong's Hang Seng index rose above 24,000 for the first time since March, driven by trade talk optimism.",
      "date": "2025-06-09",
      "scraped_at": "2025-07-09T11:43:57.660179"
    },
    {
      "headline": "Bitcoin Pushes Toward $107K Even as Trump Sends National Guard to Los Angeles",
      "description": "Bitcoin gains 0.78% despite a tense political backdrop in the U.S., with markets shrugging off fears of further unrest and a potential military mobilization.",
      "date": "2025-06-08",
      "scraped_at": "2025-07-09T11:43:57.660370"
    },
    {
      "headline": "Bitcoin Holds Above $105K Despite Donald Trump’s Threats Against Elon Musk",
      "description": "Bitcoin remains above $105K as Trump threatens Elon Musk in a high-profile feud, showing crypto's resilience amid political drama and rising market tension.",
      "date": "2025-06-07",
      "scraped_at": "2025-07-09T11:43:57.660562"
    },
    {
      "headline": "U.S. Added 139K Jobs in May, Roughly In Line With Forecasts",
      "description": "The unemployment rate remained steady at 4.2%, also matching economist forecasts.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:43:57.660755"
    },
    {
      "headline": "Trump Media, Owner of Truth Social, Looks to Issue $12B Worth of New Shares",
      "description": "The parent company of social media platform Truth Social registered with the SEC  to issue up 84,657,181 shares of Common Stock",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:43:57.661025"
    },
    {
      "headline": "Strategy to Raise Nearly $1B With STRD Preferred Stock Offering to Accumulate BTC",
      "description": "The new STRD offer long-term investors high-yield returns and no management fees.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:43:57.661215"
    },
    {
      "headline": "Bitcoin Price Bounce to Near $104K, Though Encouraging, Falls Short of Bull Revival",
      "description": "BTC's bearish H&S breakdown from Thursday is still valid.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:44:00.254079"
    },
    {
      "headline": "Metaplanet to Raise $5.3B, Japan’s Largest Stock Warrant Deal, to Grow Bitcoin Stash",
      "description": "The company aims to increase its BTC holdings to over 210,000 by 2027, viewing it as a hedge against Japan’s economic challenges.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:44:00.254377"
    },
    {
      "headline": "Elon Musk Joins Bitcoin Maxis in Warning of ‘Potential’ U.S. Fiscal Collapse or Are We There Already?",
      "description": "A long-standing view of BTC maxis – that the U.S. fiscal policy is unsustainable – has received a nod from billionaire tech entrepreneur Elon Musk.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:44:00.254560"
    },
    {
      "headline": "Bitcoin, Ether Bulls Hit With $800M Liquidation as Trump-Musk Tussle Rattles BTC, ETH",
      "description": "Exchanges like Bybit and Binance saw the biggest hits, with Bybit alone accounting for nearly $354 million in liquidations.",
      "date": "2025-06-06",
      "scraped_at": "2025-07-09T11:44:00.254748"
    },
    {
      "headline": "PTSD-Afflicted Crypto Investors Hit the Sell Button After Circle's Euphoric IPO",
      "description": "Coinbase's April 2021 debut marked what was then an epic price top for bitcoin.",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255006"
    },
    {
      "headline": "White House Crypto Chief Bo Hines Met With El Salvador’s Bukele to Discuss Bitcoin",
      "description": "\"Extraordinary things\" could happen for the United States and El Salvador as a result of the meeting, said Salvadoran Bitcoin Office Director Stacy Herbert.",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255189"
    },
    {
      "headline": "Galaxy, Fireblocks to Operate Nodes on Bitcoin Layer-2 Botanix",
      "description": "Also joining the federation running nodes are blockchain developers Alchemy, bitcoin mining pool Antpool and hedge fund manager UTXO Management",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255369"
    },
    {
      "headline": "Corporate Bitcoin Holdings Nears $85B, More Than Doubling in a Year",
      "description": "The number of public companies holding bitcoin in their treasuries has increased to 116 after surging with the election of Donald Trump.",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255547"
    },
    {
      "headline": "Leveraged Bitcoin Longs on Bitfinex Weakest Since December and It Could Mean Rally Time",
      "description": "\"When Long Positions drop, the price usually goes up,\" said one analyst.",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255803"
    },
    {
      "headline": "Core Foundation, Bitcoin Layer 1 With Over $500M Staked BTC, Adds BitGo and KODA as Validators",
      "description": "Core Foundation has announced BitGo and KODA as new validators, enhancing institutional adoption of Bitcoin-native DeFi.",
      "date": "2025-06-05",
      "scraped_at": "2025-07-09T11:44:00.255989"
    }
  ]
}